Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: སྟོང་གསུམ་ས་འདི་གྲོང་ཁྱེར་གྲོང་རྡལ་བཅས་པ་ཀུན། །གལ་ཏེ་གསེར་གྱིས་གང་ཁྱབ་དྲི་མེད་མཛེས་གྱུར་ཀྱང་།
en: “Even if the entire trichiliocosm with its cities and towns Were filled with stainless and beautiful gold,

source: །འཛམ་བུའི་ཆུ་བོའི་གསེར་གཟེགས་གཅིག་གིས་ཟིལ་རླག་སྟེ།
en: A single coin of gold from the Jambū River would steal its splendor,

source: །གསེར་གཞན་དག་ནི་དཔལ་དང་བྲལ་ཞིང་གསལ་མི་འགྱུར།
en: Leaving the other gold bereft of glory and brilliance.

source: །ས་འདི་མཐའ་དག་འཛམ་བུའི་གླིང་གི་གསེར་ཁེབས་ཀྱང་།
en: “Even if this entire earth were filled with gold from Jambudvīpa,

source: །འདྲེན་པ་དཔལ་རྒྱས་སྤུ་ཁུང་འོད་ཕྱུང་ཟིལ་གྱིས་ནོན།
en: The light radiating from the pores of the Glorious Guide would outshine it.

source: །མི་སྣང་མི་གསལ་མི་མཛེས་འོད་ཀྱང་ཉམས་གྱུར་ཅིང་།
en: It would not shine or gleam, but lose its beauty and glow;

source: །བདེ་གཤེགས་སྐྱོབ་པའི་དྲུང་ན་སྣག་ཙ་བཞིན་དུ་འགྱུར།
en: Before the Blissful Protector, it would appear just like soot.

source: །ཡོན་ཏན་བརྒྱས་གང་འདི་ནི་རང་གི་གཟི་ཡིས་བརྒྱན།
en: “He is brimming with hundreds of qualities, adorned by his own magnificence;

source: །དེ་ནི་རྒྱན་གྱིས་མཛེས་མིན་ཤིན་ཏུ་དྲི་མེད་སྐུ།
en: Not beautified by ornaments, his body is perfectly stainless.

source: །ཉི་ཟླའི་འོད་དང་སྐར་མ་ནོར་བུ་མེ་དག་དང་། །བརྒྱ་བྱིན་ཚངས་པའི་འོད་ཀྱང་དཔའ་སྟུག་མདུན་མི་གསལ།
en: The glows of the sun and moon, the stars, jewels, fire, Śakra, and Brahmā are no longer bright in front of his intense glory.

source: །གང་སྐུ་སྔོན་གྱི་དགེ་བའི་འབྲས་བུས་མཚན་སྤྲས་པ།
en: “His body is adorned with signs, the result of previous virtue,

source: །དེ་ལ་གཞན་གྱིས་བྱས་པའི་རྒྱན་ཕལ་ཅི་ཞིག་དགོས།
en: So why would he need ordinary ornaments made by someone else? Remove the ornaments!

source: །རྒྱན་རྣམས་ཕྲོལ་འོར་མི་མཁས་མཁས་མཛད་མ་གཙེ་ཤིག །བློ་གྲོས་མཆོག་མཛད་འདི་ནི་བཅོས་མའི་རྒྱན་མི་བཞེད།
en: Do not disturb the One Who Makes the Foolish Wise— He, who brings supreme knowledge, does not wear artificial ornaments!

source: །འདུན་པ་དེ་ནི་རྒྱལ་ཁབ་སྲས་དང་ལྷན་ཅིག་བཙས།
en: “Chanda was born at the same time as the son of the kingdom;

source: །དྲི་མེད་རབ་ཏུ་མཛེས་པའི་རྒྱན་རྣམས་འབངས་དེ་སྩོལ།
en: Give these beautiful spotless jewels to him, the servant.”

source: །ཤཱཀྱའི་རིགས་ནི་རྒྱ་ཆེན་མཆོག་ཏུ་འགྱུར་སྙམ་ནས།
en: Reflecting that the Śākya clan would flourish and become supreme,

source: །ཤཱཀྱ་དག་ནི་ཡིད་དགའ་མགུ་ཞིང་ངོ་མཚར་གྱུར།
en: The Śākyas were delighted and amazed.

source: །ལྷ་མོ་དེས་དེ་སྐད་ཅེས་སྨྲས་ནས། ལྷའི་མེ་ཏོག་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་མངོན་པར་གཏོར་ཏེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: Having spoken these words, the goddess scattered divine flowers over the Bodhisattva and disappeared.

source: །རྒྱན་གྱི་ལེའུ་སྟེ་དགུ་པའོ།། །།
en: This concludes the ninth chapter, on the ornaments.

source: དགེ་སློང་དག་དེ་ལྟར་གཞོན་ནུ་དེ་ཡ་ཟད་སྐྱེས་པ་དང་། བཀྲ་ཤིས་བརྒྱ་སྟོང་བྱས་ནས་ཁྱེའུ་སྟོང་ཕྲག་བཅུ་དང་། བུ་མོ་སྟོང་ཕྲག་བཅུས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་ཡི་གེའི་གྲྭར་འཇུག་པར་བྱས་སོ། །བཟའ་བ་དང་། བཅའ་བ་དང་། མྱང་བས་གང་བའི་ཤིང་རྟ་སྟོང་ཕྲག་བཅུ་དང་། གསེར་དངུལ་དང་། དབྱིག་གིས་གང་བའི་ཤིང་རྟ་སྟོང་ཕྲག་བཅུ་དྲངས་ཏེ།
en: Monks, when the young child had grown a little older, he was taken to school. He went there amid hundreds of thousands of auspicious signs, and he was surrounded and attended by tens of thousands of boys, along with ten thousand carts filled with hard food, soft food, and condiments, and ten thousand carts filled with gold coins and gems.

source: སྐྱེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་སྲང་དང་། གྲོང་བར་དང་། ཚོང་འདུས་ཀྱི་ཕྱོགས་གང་ཡིན་པ་དག་ཏུ་གཏོར་ཏོ།
en: These were distributed in the streets and road junctions, and the entrances to the markets of the city of Kapilavastu.

source: །མངོན་པར་བྱིན་ནོ། །སིལ་སྙན་འབུམ་ཕྲག་བརྒྱད་ཀྱི་སྒྲ་ཡང་ཕྱུང་ཞིང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་བབ་པོ།
en: At the same time a symphony of eight hundred thousand cymbals was sounded, and a heavy rain of flowers fell.

source: །སྟེགས་བུ་དང་། སྒོ་ཁང་དང་། རྟ་བབས་དང་། སྐར་ཁུང་དང་། བསིལ་ཁང་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་བཟངས་དག་གི་སྟེང་ནས། བུ་མོ་བརྒྱ་སྟོང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དག །བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྟ་ཞིང་མེ་ཏོག་དག་འཐོར་བར་གྱུར་ཏོ།
en: Hundreds of thousands of girls, adorned with all kinds of jewelry, perched themselves on the balconies, turrets, arches, windows, upper stories, and roofs of the homes. Gazing at the Bodhisattva, they tossed flowers.

source: །ལྷའི་བུ་མོ་སྟོང་ཕྲག་བརྒྱད་ནི་རྒྱན་རྣམས་ཀྱིས་ལྷུག་ལྷུག་པོར་བརྒྱན་ཏེ།
en: There were also eight thousand goddesses, who were adorned with loose hanging jewelry and carried bhadraṃkara gems.

source: རིན་པོ་ཆེ་བཟང་བྱེད་ཐོགས་ནས་ལམ་འཕྱག་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་མདུན་ནས་འདོང་བར་གྱུར་ཏོ།
en: They went ahead of the Bodhisattva, cleansing his way.

source: །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱང་ལུས་ཕྱེད་ཕྱུང་ཞིང་ནམ་མཁའི་དཀྱིལ་ནས་མེ་ཏོག་དང་། དར་གྱི་ལྡ་ལྡི་བྲེ་བར་གྱུར་ཏོ།
en: Gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas revealed the upper halves of their bodies, and festooned wreaths of flowers and woven silk from the sky.

source: །ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་ཀྱང་རྒྱལ་པོ་ཟས་གཙང་མའི་མདུན་དུ་བདར་ནས་བྱང་ཆུབ་སེམས་དཔའི་མདུན་ནས་འདོང་བར་གྱུར་ཏེ།
en: All the Śākya factions, with King Śuddhodana leading the way, went ahead of the Bodhisattva.

source: བཀོད་པའི་རྣམ་པ་འདི་ལྟ་བུ་འདིས་བྱང་ཆུབ་སེམས་དཔའ་ཡི་གེའི་གྲྭར་ཞུགས་པར་གྱུར་ཏོ།
en: With such an array as this, the Bodhisattva was taken to school.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཡི་གེའི་གྲྭར་ཞུགས་མ་ཐག་ཏུ། དེ་ནས་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ཞེས་བྱ་བས་བྱང་ཆུབ་སེམས་དཔའི་དཔལ་དང་གཟི་བརྗིད་མ་བཟོད་དེ། ཁས་བུབ་ཏུ་སྒྱེལ་ཏོ།
en: As soon as the Bodhisattva arrived in school, the schoolmaster, who was called Viśvāmitra, was unable to withstand the Bodhisattva’s splendor and radiance, and prostrated to him face-down on the ground.

source: །དེ་ལྟར་འགྱེལ་བ་དང་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་ཡན་ལག་བཟང་པོ་ཞེས་བྱ་བས་མཐོང་ནས། ལག་པ་གཡས་པས་བཏེག་སྟེ་བསླང་ངོ་།
en: A god from the Heaven of Joy called Śubhāṅga saw the schoolmaster collapsed on the ground and, grabbing him with his right hand, raised him up.

source: །བསླངས་ནས་ཀྱང་དེ་ནམ་མཁའི་དཀྱིལ་ན་འདུག་སྟེ། རྒྱལ་པོ་ཟས་གཙང་མ་དང་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Suspended in the sky, Śubhāṅga then spoke the following verses to King Śuddhodana and the crowd:

source: མི་ཡི་འཇིག་རྟེན་འདི་ན་བསྟན་བཅོས་གང་ཡོད་པ།
en: “Whatever topics of knowledge are circulating in this world of humans—

source: །གྲངས་དང་ཡི་གེ་རྩིས་དང་ཁམས་ཀྱི་རྒྱུད་དག་དང་། །འཇིག་རྟེན་བཟོ་ཡི་སྦྱོར་བ་ཚད་མེད་མང་པོ་དག །བསྐལ་པ་བྱེ་མང་སྔོན་ཆད་འདིས་ནི་དེ་དག་བསླབས།
en: Numbers, scripts, mathematics, the permutations of the elements, And all the immeasurable mundane techniques of craftsmanship— This child already learned these things many tens of millions of eons ago.

source: །འོན་ཀྱང་སྐྱེ་བོའི་རྗེས་སུ་འཐུན་པ་ཙམ་མཛད་དེ།
en: “Nonetheless he acts solely in harmony with people. The Well-Instructed One thus came to school for the sake of instruction,

source: །བྱིས་པ་མང་པོ་ཐེག་པ་མཆོག་ལ་སྨིན་མཛད་དང་། །སེམས་ཅན་ཁྲག་ཁྲིག་གཞན་ཡང་འཆི་མེད་དགོད་པའི་ཕྱིར། །ཤིན་ཏུ་ལོབས་པའང་བསླབ་ཕྱིར་ཡི་གེའི་གྲྭར་ཞུགས་སོ།
en: In order to mature many children for the Highest Vehicle And to bring a myriad other beings to immortality.

source: །འཇིག་རྟེན་འདས་པའི་བདེན་བཞི་ལམ་གྱི་ཚུལ་མཁྱེན་ཅིང་།
en: “He knows the way of the path of the transcendent four truths.

source: །རྒྱུ་ལ་བརྟེན་ནས་ཇི་ལྟར་འབྱུང་བ་དེ་ལའང་མཁས།
en: He is adept in how things arise based on causes,

source: །ཇི་ལྟར་འདུས་བྱས་འགགས་ཟད་བསིལ་འགྱུར་དེ་ཚུལ་ཡང་།
en: And how the cessation and termination of conditioned existence leads to the calm state.

source: །མཁྱེན་ན་ཡི་གེའི་བསྟན་བཅོས་ཙམ་ལྟ་ཅིས་མི་མཁྱེན།
en: When he knows all that, how could he not know the subject of scripts?

source: །འཇིག་རྟེན་གསུམ་ན་འདི་ཡི་སློབ་དཔོན་གོང་ན་མེད།
en: “There is no master superior to him throughout the three worlds;

source: །ལྷ་དང་མིར་བཅས་ནང་ན་འདི་ཉིད་གཙོ་བོ་སྟེ།
en: Among all gods and humans, he alone is foremost.

source: །བསྐལ་པ་བྱེ་མང་སྔོན་ཆད་གང་ལ་འདིས་བསླབས་པའི། །
en: All of you do not know even the names of the scripts

source: ཡི་གེ་དེ་དག་མིང་ཡང་ཁྱེད་ཀྱིས་ཤེས་མི་འགྱུར། །
en: That he has learned before, many tens of millions of eons ago.

source: འགྲོ་བ་རྣམས་ཀྱི་སེམས་རྒྱུད་སྣ་ཚོགས་གང་འབྱུང་བ། །སྐད་ཅིག་གཅིག་གིས་སེམས་ཅན་དག་པ་འདིས་མཁྱེན་ཏེ།
en: “This pure being knows in a single instant The manifold, diverse thoughts of beings.

source: །གཟུགས་མེད་བལྟར་མི་སྣང་བའི་ཚུལ་ཡང་རབ་མཁས་ན།
en: When he knows such invisible and formless things,

source: །ཡི་གེ་གཟུགས་ཡོད་བལྟར་སྣང་དག་ལྟ་སྨོས་ཅི་དགོས།
en: Why mention the visible forms of scripts?”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་བུ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྷའི་མེ་ཏོག་མང་པོས་གཏོར་ཏེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ཏོ།
en: When he had spoken these verses, the god honored the Bodhisattva with celestial flowers and immediately thereafter disappeared.

source: །དེ་ནས་མ་མ་དང་བྲན་མོའི་འཁོར་བཀོད་དེ། རྒྱལ་པོ་ཟས་གཙང་མ་ལ་སོགས་པ་ཤཱཀྱ་གཞན་ནི་ཕྱིར་དོང་ངོ་།
en: The nannies and the entourage of maids were asked to stay at the school, while the remaining Śākyas, headed by Śuddhodana, departed.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོ་ལས་བྱས་པའི་ཡི་གེའི་ཤིང་ལྷའི་ཚོན་གྱིས་བྱུགས་པ། གསེར་གྱི་ཡང་མིག་གིས་བཏགས་པ། མཐའ་མ་ནོར་བུ་རིན་པོ་ཆེས་ཀུན་ནས་བརྒྱན་པ་ཐོགས་ཏེ།
en: The Bodhisattva took up a writing board made of sandalwood. It was decorated with flecks of divine gold of prime quality and studded with precious gems on all sides.

source: སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: He then addressed the master Viśvāmitra:

source: ཀྱེ་མཁན་པོས་བདག་ལ་ཡི་གེ་གང་ཞིག་བསླབ། ཚངས་པའི་ཡི་གེའམ། ཁ་རོ་སྟིའི་ཡི་གེའམ། པད་མའི་སྙིང་པོའི་ཡི་གེའམ། ཨང་གའི་ཡི་གེའམ། མང་གའི་ཡི་གེའམ། ཡུལ་མ་ག་དྷཱའི་ཡི་གེའམ། བཀྲ་ཤིས་པའི་ཡི་གེའམ། སོར་མོ་པའི་ཡི་གེའམ། ཤ་ཀ་ནིའི་ཡི་གེའམ། ཡ་བ་ནའི་ཡི་གེའམ། བག་ལེ་བའི་ཡི་གེའམ། པ་རུ་ཤའི་ཡི་གེའམ། འགྲོ་ལྡིང་བའི་ཡི་གེའམ། ཀིར་ཏའི་ཡི་གེའམ། ལྷོ་ཕྱོགས་པའི་ཡི་གེའམ། དྲག་ཤུལ་ཅན་གྱི་ཡི་གེའམ། གྲངས་ཀྱི་ཡི་གེའམ། སྤྱིའུ་ཚུགས་པའི་ཡི་གེའམ། རྗེས་སུ་འཐུན་པའི་ཡི་གེའམ། བྲུ་ཤའི་ཡི་གེ་འམ། ཀ་ཤའི་ཡི་གེའམ། རྒྱའི་ཡི་གེའམ། ཕུ་ནའི་ཡི་གེའམ། ཧུ་ནའི་ཡི་གེའམ། ཡི་གེ་འབྲིང་དང་། རྒྱས་པར་བྲི་བའི་ཡི་གེའམ། རྒྱལ་གྱི་ཡི་གེའམ། ལྷའི་ཡི་གེའམ། ཀླུའི་ཡི་གེའམ། གནོད་སྦྱིན་གྱི་ཡི་གེའམ། དྲི་ཟའི་ཡི་གེའམ། མི་འམ་ཅིའི་ཡི་གེའམ། ལྟོ་འཕྱེ་ཆེན་པོའི་ཡི་གེའམ། ལྷ་མ་ཡིན་གྱི་ཡི་གེའམ། ནམ་མཁའ་ལྡིང་གི་ཡི་གེའམ། རི་དགས་ཀྱི་འཁོར་ལོ་བའི་ཡི་གེའམ། ཁྭ་སྐད་ཤེས་པའི་ཡི་གེའམ། ས་བླའི་ལྷའི་ཡི་གེའམ། བར་སྣང་གི་ལྷའི་ཡི་གེའམ། ནུབ་ཀྱི་བ་གླང་སྤྱོད་ཀྱི་ཡི་གེའམ། བྱང་གི་སྒྲ་མི་སྙན་གྱི་ཡི་གེའམ། ཤར་གྱི་ལུས་འཕགས་པོའི་ཡི་གེའམ། གདེག་པའི་ཡི་གེའམ། གཞག་པའི་ཡི་གེའམ། བསྣན་པའི་ཡི་གེའམ། རྒྱ་མཚོའི་ཡི་གེའམ། རྡོ་རྗེའི་ཡི་གེའམ། སྤྲིང་ཡིག་དང་། ལན་གྱི་ཡི་གེའམ། རྣམ་འཐོར་གྱི་ཡི་གེའམ། རིངས་མེད་ཀྱི་ཡི་གེའམ། བསྟན་བཅོས་བསྐོར་བའི་ཡི་གེའམ། རྩིས་བསྐོར་བའི་ཡི་གེའམ། གདེག་པ་བསྐོར་བའི་ཡི་གེའམ། གཞག་པ་བསྐོར་བའི་ཡི་གེའམ། རྐང་པས་བྲིས་པའི་ཡི་གེའམ། ཚིག་ལན་ལན་གཉིས་སུ་གདབ་པའི་ཚིག་གི་མཚམས་ཀྱི་ཡི་གེའམ། ཚིག་གི་མཚམས་བཅུར་བརྒྱུད་པའི་བར་གྱི་ཡི་གེའམ། བླ་ཐབས་སུ་བསྣན་པའི་ཡི་གེའམ། སྒྲ་ཐམས་ཅད་ཀུན་ཏུ་སྡུད་པའི་ཡི་གེའམ། རིག་པ་དང་འཐུན་པའི་ཡི་གེའམ། རྣམ་པར་འདྲེས་པའི་ཡི་གེའམ། དྲང་སྲོང་གི་དཀའ་ཐུབ་སྤྱད་པའི་ཡི་གེའམ། ལྷའི་ངེས་པའི་ཡི་གེའམ། ས་བལྟ་བའི་ཡི་གེའམ། ནམ་མཁའ་བལྟ་བའི་ཡི་གེའམ། སྨན་ཐམས་ཅད་ཀྱི་རྒྱུ་འཐུན་པའི་ཡི་གེའམ། སྙིང་པོ་ཐམས་ཅད་ཀུན་ཏུ་སྡུད་པའི་ཡི་གེའམ། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་སྒྲ་སྡུད་པའི་ཡི་གེའམ། ཀྱེ་སློབ་དཔོན་ཡི་གེ་དྲུག་ཅུ་རྩ་བཞི་པོ་དེ་དག་གི་ནང་ནས་བདག་ལ་གང་བསླབ།
en: “Which script, O master, will you be teaching me? Will it be the Brāhmī script, the Kharoṣṭī script, or the Puṣkarasāri script? Will it be the Aṅga script, the Vaṅga script, the Magadha script, the Maṅgalya script, the Aṅgulīya script, the Śakāri script, the Brahmavali script, the Pāruṣya script, the Drāviḍa script, the Kirāta script, the Dākṣiṇya script, the Ugra script, the Saṃkhyā script, the Anuloma script, the Avamūrdha script, the Darada script, the Khāṣya script, the Cīna script, the Lūna script, the Hūṇa script, the Madhyākṣara­vistara script, the Puṣpa script, the Deva script, the Nāga script, the Yakṣa script, the Gandharva script, the Kinnara script, the Mahoraga script, the Asura script, the Garuḍa script, the Mṛgacakra script, the Vāyasaruta script, the Bhaumadeva script, the Antarīkṣa­deva script, the Uttara­kuru­dvīpa script, the Aparagoḍānī script, the Pūrvavideha script, the Utkṣepa script, the Nikṣepa script, the Vikṣepa script, the Prakṣepa script, the Sāgara script, the Vajra script, the Lekhapratilekha script, the Anudruta script, the Śāstrāvarta script, the Gaṇanāvarta script, the Utkṣepāvarta script, the Nikṣepāvarta script, the Pādalikhita script, the Dviruttara­pada­saṃdhi script, the Yāvaddaśottara­pada­saṃdhi script, the Madhyāhāriṇī script, the Sarva­ruta­saṃgrahaṇī script, the Vidyānulomā­vimiśrita script, the Ṛṣi­tapastapta script, the Rocamāna script, the Dharaṇī­prekṣiṇī script, the Gagana­prekṣiṇī script, the Sarvauṣadhi­niṣyanda script, the Sarva­sāra­saṃgrahaṇī script, or the Sarva­bhūta­ruta­grahaṇī script? Master, which of those sixty-four scripts will you teach me?”

source: དེ་ནས་བྱིས་པའི་སློབ་དཔོན་ཀུན་གྱི་བཤེས་གཉེན་ངོ་མཚར་དུ་གྱུར་ནས་བཞིན་གྱི་འཛུམ་ཕྱུང་སྟེ།
en: The schoolmaster Viśvāmitra was amazed, and he smiled.

source: ང་རྒྱལ་དང་། དྲེགས་པ་དང་། རྒྱགས་པ་མེད་པར་བྱས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Setting aside pride, conceit, and arrogance, he replied with the following verses:

source: །སེམས་ཅན་དག་པ་ངོ་མཚར་ཆེ།
en: “How wonderful! Even though the Pure Being

source: །བསྟན་བཅོས་ཀུན་ལས་བསླབས་གྱུར་ཀྱང་།
en: Is learned in all the treatises, in the world ,

source: །འཇིག་རྟེན་འཇིག་རྟེན་རྗེས་བསྙག་ཕྱིར།
en: He follows the conventions of the world.

source: །ཡི་གེའི་གྲྭར་ནི་བྱོན་པར་གྱུར།
en: Thus he has come to school.

source: །ཡི་གེ་གང་གི་མིང་དག་ཀྱང་། །བདག་གིས་ཤེས་པར་མ་གྱུར་པ། །དེ་ལ་འདི་ལ་བྱང་གྱུར་ཀྱང་། །ཡི་གེ་སློབ་པའི་གྲྭར་བྱོན་ཏོ།
en: “He has learned scripts Even the names of which I have not heard, Yet he has come to school.

source: །འདི་ཡི་ཞལ་ནི་མཐོང་མོད་ཀྱི།
en: “Although I indeed see his face,

source: །སྤྱི་གཙུག་འཕགས་པ་བལྟར་མི་སྣང་།
en: But The crown of his head is out of sight.

source: །ཡི་གེའི་ཤེས་རབ་མཐར་ཕྱིན་ན།
en: If his knowledge of scripts is already perfect,

source: །བདག་གིས་འདི་གོ་ཇི་ལྟར་བསླབ།
en: How can I school him in that knowledge?

source: །ལྷ་ཡི་ལྷ་ཆེན་ལྷ་འདི་ནི།
en: “This god, great god of gods,

source: །ལྷ་རྣམས་ཀུན་གྱི་མཆོག་མཁས་པ།
en: Supreme divine scholar among all gods,

source: །ཁྱད་པར་འཕགས་ཤིང་མཉམ་པ་མེད།
en: Is superior and without equal.

source: །འཇིག་རྟེན་གང་ཟག་དོ་ཟླ་མེད།
en: No person in the world is comparable to him.

source: །བདག་ཀྱང་འདི་ཉིད་མཐུ་ཡིས་ན། །ཤེས་རབ་ཐབས་ཀྱི་ཁྱད་པར་གྱིས། །འཇིག་རྟེན་ཀུན་ཀྱི་དཔུང་གཉེན་པོ། །ལོབས་པ་འདི་ནི་བསླབ་པར་བྱ།
en: “Only because of his unparalleled expertise In applying knowledge and means, Will I teach this learned being—The final refuge of all beings.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱིས་པ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་དང་ལྷན་ཅིག་ཏུ་ཡི་གེ་སློབ་པའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིས་པ་དེ་དག་ཡི་གེའི་ཕྱི་མོ་སློབ་ཅིང་གང་གི་ཚེ།
en: Monks, then the schoolmaster taught writing to the Bodhisattva, along with ten thousand other children. However, through the power of the Bodhisattva, as the schoolmaster was saying the alphabet to the children, he did it in the following manner:

source: ཨ་ཞེས་བརྗོད་པ་དེའི་ཚེ།
en: “When he said the letter a, out came the statement:

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པའི་སྒྲ་བྱུང་ངོ་།
en: ‘Every composite phenomenon is impermanent (anityaḥ sarva­saṃ­skāraḥ).’

source: ཨཱ་ཞེས་བརྗོད་པ་དང་བདག་མེད་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ā, out came the statement: ‘Beneficial to self and others (ātmaparahita).’

source: །ཨི་ཞེས་བརྗོད་པ་དང་དབང་པོ་ཤིན་ཏུ་ཡངས་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter i, out came the statement: ‘The vast development of the senses (indriyavaipulya).’

source: །ཨཱི་ཞེས་བརྗོད་པ་དང་འགྲོ་བ་ནི་ཡམས་ཀྱི་ནད་མང་བ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ī, out came the statement: ‘The world is riddled with plague (ītibahulaṃ jagat).’

source: །ཨུ་ཞེས་བརྗོད་པ་དང་འགྲོ་བ་ནི་འཚེ་བ་མང་ངོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter u, out came the statement: ‘The world is rife with misfortune (upa­drava­bahulaṃ jagat).’

source: །ཨཱུ་ཞེས་བརྗོད་པ་དང་འགྲོ་བ་ནི་དམའ་བའོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ū, out came the statement: ‘The world is of little substance (ūnasattvaṃ jagat).’

source: །ཨེ་ཞེས་བརྗོད་པ་དང་། ཉེས་པ་ནི་བཙལ་བ་ལས་བྱུང་ངོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter e, out came the statement: ‘Faults come from desire (eṣaṇā­samutthāna­doṣa).’

source: །ཨཻ་ཞེས་བརྗོད་པ་དང་འཕགས་པའི་ལམ་ནི་དགེའོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ai, out came the statement: ‘The noble path is virtuous (airyāpathaḥ śreyāniti).’

source: །ཨོ་ཞེས་བརྗོད་པ་དང་ཆུ་བོ་ལས་རྒལ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter o, out came the statement: ‘The stream has been forded (oghottara).’

source: །ཨཽ་ཞེས་བརྗོད་པ་དང་རྫུབ་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter au, out came the statement: ‘Spontaneously generated (aupapāduka).’

source: །ཨཾ་ཞེས་བརྗོད་པ་དང་བདག་གི་བ་མི་འབྱུང་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter aṃ, out came the statement: ‘The emergence of what is efficacious (amoghotpatti).’

source: །ཨཿཞེས་བརྗོད་པ་དང་ནུབ་པ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter aḥ, out came the statement: ‘Reaching an end (astaṃgamana).’

source: །ཀ་ཞེས་བརྗོད་པ་དང་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter ka, out came the statement: ‘Immersion in the full ripening of actions (karma­vipākāvatāra).’

source: །ཁ་ཞེས་བརྗོད་པ་དང་ཆོས་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter kha, out came the statement: ‘All phenomena are like space (kha­sama­sarva­dharma).’

source: །ག་ཞེས་བརྗོད་པ་དང་ཆོས་ཟབ་ཅེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ga, out came the statement: ‘Immersion in the profound Dharma of dependent origination (gambhīra­dharma­pratītya­samutpādāvatāra).’

source: །གྷ་ཞེས་བརྗོད་པ་དང་མ་རིག་པ་དང་། གཏི་མུག་གི་མུན་པ་དང་ལིང་ཐོག་སྟུག་པོ་བསལ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter gha, out came the statement: ‘Eradicating the darkness of delusion and the thick veils of ignorance (ghana­paṭalāvidyā­mohāndhakāra­vidhamana).’

source: །ང་ཞེས་བརྗོད་པ་དང་ཡན་ལག་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ṅ, out came the statement: ‘The complete purification of factors (aṅgaviśuddhi).’

source: །ཙ་ཞེས་བརྗོད་པ་དང་འཕགས་པའི་བདེན་པ་བཞིའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter ca, out came the statement: ‘The path of the four noble truths (caturārya­satya­patha).’

source: །ཚ་ཞེས་བརྗོད་པ་དང་འདོད་པའི་འདོད་ཆགས་སྤང་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter cha, out came the statement: ‘Abandoning the passion of lust (chanda­rāga­prahāṇa).’

source: །ཛ་ཞེས་བརྗོད་པ་དང་རྒ་ཤི་ལས་ཡང་དག་པར་འདས་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ja, out came the statement: ‘Transcending old age and death (jarā­maraṇa­samatikramaṇa).’

source: །ཛྷ་ཞེས་བརྗོད་པ་དང་འཆི་བྱེད་ཀྱི་རྒྱལ་མཚན་ཅན་གྱི་དཔུང་ཚར་བཅད་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter jha, out came the statement: ‘Vanquishing the forces of the god of love (jhaṣa­dhvaja­bala­nigrahaṇa).’

source: །ཉ་ཞེས་བརྗོད་པ་དང་ཤེས་པར་བྱེད་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ña, out came the statement: ‘Making known (jñāpana).’

source: །ཊ་ཞེས་བརྗོད་པ་དང་ལམ་ཤིན་ཏུ་ཆད་པའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter ṭa, out came the statement: ‘Severing the round of rebirths (vaṭṭopacchedana).’

source: །ཋ་ཞེས་བརྗོད་པ་དང་དྲི་བ་བཞག་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ṭha, out came the statement: ‘A question rejected out of hand (ṭhapanīyapraśna).’

source: །ཌ་ཞེས་བརྗོད་པ་དང་དཀྲུགས་མ་དང་བདུད་ཚར་བཅད་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ḍa, out came the statement: ‘Vanquishing the evil one and those who cause discord (ḍamara­māra­nigrahaṇa).’

source: །ཌྷ་ཞེས་བརྗོད་པ་དང་ཡུལ་མི་གཙང་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ḍha, out came the statement: ‘The impure regions (mīḍhaviṣayāḥ).’

source: །ཎ་ཞེས་བརྗོད་པ་དང་ཉོན་མོངས་པ་ནི་ཕྲ་བ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ṇa, out came the statement: ‘Afflictions are subtle (reṇukleśāḥ).’

source: །ཏ་ཞེས་བརྗོད་པ་དང་དེ་བཞིན་ཉིད་ནི་འདྲེས་པ་མེད་ཅེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter ta, out came the statement: ‘Suchness is undifferentiated (tathatāsaṃbheda).’

source: །ཐ་ཞེས་བརྗོད་པ་དང་མཐུ་སྟོབས་དང་ཤུགས་དང་མི་འཇིགས་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter tha, out came the statement: ‘Strength, power, force, and self-confidence (thāma­bala­vegavaiśāradya).’

source: །ད་ཞེས་བརྗོད་པ་དང་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པ་དང་། ངེས་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter da, out came the statement: ‘Generosity, discipline, restraint, and gentleness (dāna­dama­saṃyama­saurabhya).’

source: །དྷ་ཞེས་བརྗོད་པ་དང་འཕགས་པ་རྣམས་ཀྱི་ནོར་ནི་རྣམ་པ་བདུན་ནོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter dha, out came the statement: ‘The wealth of the noble ones is sevenfold (dhanamāryāṇāṃ saptavidham).’

source: །ན་ཞེས་བརྗོད་པ་དང་མིང་དང་གཟུགས་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter na, out came the statement: ‘Full knowledge of name and form (nāmarūpaparijñā).’

source: །པ་ཞེས་བརྗོད་པ་དང་དོན་དམ་པའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter pa, out came the statement: ‘The absolute (paramārtha).’

source: །ཕ་ཞེས་བརྗོད་པ་དང་འབྲས་བུ་རྙེད་པ་མངོན་དུ་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter pha, out came the statement: ‘The actualization of the attainment of the fruition (phala­prāpti­sākṣātkriyā).’

source: །བ་ཞེས་བརྗོད་པ་དང་བཅིངས་པ་ལས་རྣམ་པར་ཐར་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ba, out came the statement: ‘Liberation from bondage (bandhanamokṣa).’

source: །བྷ་ཞེས་བརྗོད་པ་དང་སྲིད་པ་འཇིགས་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter bha, out came the statement: ‘The destruction of existence (bhavavibhava).’

source: །མ་ཞེས་བརྗོད་པ་དང་ང་རྒྱལ་དང་རྒྱགས་པ་ཞི་བར་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ma, out came the statement: ‘The cessation of arrogance and pride (mada­mānopaśamana).’

source: །ཡ་ཞེས་བརྗོད་པ་དང་ཆོས་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པར་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter ya, out came the statement: ‘Understanding phenomena exactly as they are (yathāvaddharma­prativedha).’

source: །ར་ཞེས་བརྗོད་པ་དང་དགའ་བ་ལ་དགའ་བ་མེད་པའི་དོན་དམ་པར་དགའ་བ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ra, out came the statement: ‘Dissatisfaction with pleasure is delighting in the absolute (ratyarati­paramārtha­rati).’

source: །ལ་ཞེས་བརྗོད་པ་དང་འཁྲི་ཤིང་ཆད་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter la, out came the statement: ‘Severing the vine (latāchedana).’

source: །ཝ་ཞེས་བརྗོད་པ་དང་ཐེག་པ་མཆོག་གི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter va, out came the statement: ‘The best vehicle (varayāna).’

source: །ཤ་ཞེས་བརྗོད་པ་དང་ཞི་གནས་དང་ལྷག་མཐོང་གི་སྒྲ་བྱུང་ངོ་།
en: “When he said the letter śa, out came the statement: ‘Calm abiding and insight (śamatha­vipaśyanā).’

source: །ཥ་ཞེས་བརྗོད་པ་དང་སྐྱེ་མཆེད་དྲུག་གཞོམ་ཞིང་མངོན་པར་ཤེས་པ་དྲུག་དང་ཡེ་ཤེས་ཐོབ་པའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ṣa, out came the statement: ‘Destroying the six sense bases and obtaining the superknowledges and wisdoms (ṣaḍāyatana­nigrahaṇābhijña­jñānāvāpti).’

source: །ས་ཞེས་བརྗོད་པ་དང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter sa, out came the statement: ‘Attaining the perfect awakening to omniscient wisdom (sarva­jña­jñānābhisaṃ­bodhana).’

source: །ཧ་ཞེས་བརྗོད་པ་དང་ཉོན་མོངས་པ་བཅོམ་ཞིང་འདོད་ཆགས་དང་བྲལ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter ha, out came the statement: ‘Destroying the afflictions and parting from desire (hatakleśavirāga).’

source: །ཀྵ་ཞེས་བརྗོད་པ་དང་ཡི་གེའི་མཐར་ཕྱིན་ཏེ། ཆོས་ཐམས་ཅད་བརྗོད་དུ་མེད་པའོ་ཞེས་བྱ་བའི་སྒྲ་བྱུང་ངོ་།
en: When he said the letter kṣa, out came the statement: ‘Reaching the end of letters, all phenomena are ineffable (kṣara­paryantābhilāpya sarvadharma).’ ”
